namespace HiraganaKatakana2.Data
{
    public class AlphabetModel
    {
        public Dictionary<string, string> Hiragana = new()
        {
            {"あ","a"},  {"い","i"}, {"う","u"}, {"え","e"}, {"お","o"},
            {"か","ka"},  {"き","ki"}, {"く","ku"}, {"け","ke"}, {"こ","ko"},
            {"さ","sa"},  {"し","shi"}, {"す","su"}, {"せ","se"}, {"そ","so"},
            {"た","ta"},  {"ち","chi"}, {"つ","tsu"}, {"て","te"}, {"と","to"},
            {"な","na"},  {"に","ni"}, {"ぬ","nu"}, {"ね","ne"}, {"の","no"},
            {"は","ha"},  {"ひ","hi"}, {"ふ","fu"}, {"へ","he"}, {"ほ","ho"},
            {"ま","ma"},  {"み","mi"}, {"む","mu"}, {"め","me"}, {"も","mo"},
            {"ら","ra"},  {"り","ri"}, {"る","ru"}, {"れ","re"}, {"ろ","ro"},
            {"や","ya"},               {"ゆ","yu"},             {"よ","yo"},
            {"わ","wa"},               {"を","wo"},             {"ん","n"}
        };

        public Dictionary<string, string> Katakana = new()
        {
            {"ア","a"},  {"イ","i"}, {"ウ","u"}, {"エ","e"}, {"オ","o"},
            {"カ","ka"},  {"キ","ki"}, {"ク","ku"}, {"ケ","ke"}, {"コ","ko"},
            {"サ","sa"},  {"シ","shi"}, {"ス","su"}, {"セ","se"}, {"ソ","so"},
            {"タ","ta"},  {"チ","chi"}, {"ツ","tsu"}, {"テ","te"}, {"ト","to"},
            {"ナ","na"},  {"ニ","ni"}, {"ヌ","nu"}, {"ネ","ne"}, {"ノ","no"},
            {"ハ","ha"},  {"ヒ","hi"}, {"フ","fu"}, {"ヘ","he"}, {"ホ","ho"},
            {"マ","ma"},  {"ミ","mi"}, {"ム","mu"}, {"メ","me"}, {"モ","mo"},
            {"ラ","ra"},  {"リ","ri"}, {"ル","ru"}, {"レ","re"}, {"ロ","ro"},
            {"ヤ","ya"},               {"ユ","yu"},             {"ヨ","yo"},
            {"ワ","wa"},               {"ヲ","wo"},             {"ン","n"}
        };
    }
}
